{
  "navigation": {
    "language": "EN",
    "about": "à propos",
    "skills": "compétences",
    "projects": "projets",
    "work experience": "Expérience professionnelle",
    "testimonials": "témoignages",
    "resume": "CV",
    "name": "nom"
  },
  "page": {
    "landingpage": {
      "name": "Nicholas Martoccia",
      "typeout string1": "< Développeur de logiciels / >",
      "typeout string2": "< Étudiant en science informatique / >",
      "enter btn": "entrer dans le portfolio"
    },
    "about": {
      "paragraph1": "Tout au long de mon parcours académique, j'ai toujours excellé, recevant de multiples distinctions sur la liste du doyen. Mon leadership va au-delà du monde académique. J'ai dirigé l'équipe de programmation au sein du club de robotique et du club de cybersécurité étudiant de mon établissement.",
      "paragraph2": "Dans mon rôle de stagiaire en développement de logiciels front-end à l'Université de Sherbrooke, j'ai acquis une expérience pratique dans la création de composants Web conviviaux en utilisant HTML, CSS et Lit. Mon engagement envers l'apprentissage continu m'a permis d'acquérir de nouvelles compétences et technologies. Cela m'a équipé pour relever des défis du monde réel et apporter des contributions significatives à des projets.",
      "learn more header": {
        "header": "En savoir plus sur mes :",
        "skills": "Compétences",
        "projects": "Projets",
        "work experience": "Expérience professionnelle",
        "testimonials": "Témoignages",
        "resume": "CV"
      }
    },
    "skills": {
      "header": "Compétences",
      "paragraph": "Le diagramme offre un aperçu d'une sélection de mes compétences. Pour une vue d'ensemble plus complète de mes capacités, je vous invite à explorer les projets disponibles sur mon profil GitHub lié ci-dessous. Les projects démontrent non seulement ma maîtrise de divers langages, mais mettent également en avant la polyvalence que j'apporte à chaque projet."
    },
    "projects": {
      "header": "Projets",
      "chatroom": {
        "header": "ChatRoom",
        "description": "Chatroom Full stack PHP Laravel et ReactJs. La salle de discussion permet aux utilisateurs de s'envoyer des messages. Les utilisateurs peuvent créer un compte et se connecter à la discussion. L'application permet un format de messagerie en groupe en montrant les utilisateurs actifs dans le groupe."
      },
      "movingexpress": {
        "header": "Moving Express",
        "description": "Application web Full-stack pour une entreprise de déménagement à Montréal, avec Spring Boot et React (TypeScript). Comprend une documentation étendue, permettant aux utilisateurs de générer des devis, de modifier des expéditions et de générer des rapports. Auth0 gère l'authentification des utilisateurs, y compris les connexions sociales. Développé en collaboration, mes contributions ont porté sur l'authentification, l'e-mail, les services d'expédition, de devis et de deploiement CI/CD."
      },
      "quizcode": {
        "header": "Quiz Code",
        "description": "Application IOS construite sur l'architecture MVVM, offrant une pratique de codage en HTML, Docker, Linux, PHP, JavaScript, et plus encore. Propose des quiz interactifs alimentés par QuizAPI.io et utilise Firebase pour stocker les scores des utilisateurs en utilisant le modèle singleton, permettant le suivi des progrès."
      },
      "librarymanager": {
        "header": "Gestionnaire de bibliothèque Silk Reads",
        "description": "Application full-stack visant à simplifier les tâches d'administration de bibliothèque, telles que l'ajout de nouvelles bibliothèques et la mise à jour des livres. Backend alimenté par Java Spring Boot utilisant l'architecture REST avec JPA et Hibernate ORM. Frontend développé en JavaScript, HTML, et stylisé avec CSS et React-Bootstrap."
      },
      "smarthomehub": {
        "header": "EcoSmart Home Hub",
        "description": "EcoSmart Home Hub est une preuve de concept IoT utilisant Flask pour le backend et React pour l'interface. Offrant un contrôle des appareils, une surveillance environnementale en temps réel, et un tableau de bord convivial, le backend Flask gère le traitement des données, la communication avec les appareils, et l'authentification des utilisateurs. Le frontend React communique via des APIs RESTful, permettant aux utilisateurs de gérer efficacement leur environnement domestique pour une vie durable."
      }
    },
    "workexperience": {
      "header": "Expérience professionnelle",
      "job1": {
        "name": "Technicien de déploiement - Control Force & Motion",
        "company": "CAE",
        "description": "Était chargé d'effectuer des tests sur les simulateurs et de générer des rapports pour garantir que les comportements des simulateurs étaient dans le delta autorisé par les ingénieurs. Collaboration à des projets IoT pour améliorer le comportement et les fonctionnalités des simulateurs.",
        "period": "février 2024 - mai 2024"
      },
      "job2": {
        "name": "Programmeur principal du Club de Robotique",
        "company": "Champlain College Saint-Lambert",
        "description": "A participé et représenté mon école lors de compétitions de robotique CRC. A participé en tant que programmeur du robot (Arduino C++) et chef de d'équipe pour le défi de programmation Java.",
        "period": "janvier 2022 - janvier 2024"
      },
      "job3": {
        "name": "Stagiaire en développement de logiciels",
        "company": "Université de Sherbrooke, Québec",
        "description": "Construit et développé des composants web en utilisant TypeScript et le framework Lit pour une recherche fédérale sur la pensée critique computationnelle et logique.",
        "period": "juin 2022 - août 2022"
      }
    },
    "testimonials": {
      "header": "Témoignages",
      "subheader": "Laisser un témoignage",
      "description": "Vous trouverez ici des recommandations de collègues et d'employeurs passés. Si vous souhaitez laisser une recommandation, veuillez remplir le formulaire ci-dessous et n'oubliez pas d'inclure votre nom et l'entreprise où vous avez travaillé avec moi.",
      "name_field": "Nom complet",
      "company_field": "Entreprise",
      "message_field": "Message..."
    }
  }
}
